{
    "name": "Leduc Hold'em Poker Limit",
    "game_rule":
            "Leduc Hold'em is first introduced in Bayes' Bluff: Opponent Modeling in Poker. Note that the deck consists only two cards of King, Queen and Jack, six cards in total. Each game is fixed with two players, only two rounds, and two-bet maximum in each round. Note that one public hand is available at the beginning of the second round. There are four actions that players can choose: raise, call, check and fold. Raise action: In the first round (when the public card not revealed), you have to put chips to make sure your chips in pot with amounts of 2 more than that of your opponent when you raise; in the second round (after the public card revealed), you have to put chips to make sure your chips in pot with amounts of 4 more than that of your opponent when you raise. Call action: you will put chips with same amounts as your opponent (if his chips in the pot are higher than yours).  Check action: you will pass on the opportunity to bet and wait to see what the next player does. Fold action: you will drop out and lose the money you may have already put in the pot when you decide not to continue playing the game.  In the first round, one player is randomly choosed to put 1 unit in the pot as small blind while the other puts 2 unit as big blind, and each player is dealt one private card, then starts betting. The player with small blind acts first. In the second round, one public card is revealed first, then the players bet again. (Only one public card is available in the whole game.)   \n Single Game Win/Draw/Lose Rule: the player whose hand has the same rank as the public card is the winner of one round game. If neither, then the one with higher rank wins this round game, if the rank of cards of two players are the same, it is draw. You can also 'fold' in one round game then your opponent wins the game directly.  \n Whole Game Win/Draw/Lose Rule: you are requested to attend 100 games with your opponent in the test stage (i.e. ), you both are given 100 chips originally, and the guy who have more chips will win the game after the tested 100 games (i.e. You aim to have more chips than your original chips). \n Winning Payoff Rule:  The half of  the total pot. \n Lose Payoff Rule:  The half of the total pot. ",
         "observation_rule": "The observation is a dictionary. The main observation space: 'raw_legal_actions' which holds the legal actions you can choose in the current betting. 'hand' is the hole hand, and 'public_card' is the revealed public card, where SJ denotes the J of Spades, HK denotes King of Hearts.  'game_num' is the index of game currently. 'all_chips' is a list which contains the number of chips you and your opponent has been put in the pot, respectively, where the first element of 'all_chips' is the number of chips you have put in the pot, the second element of 'all_chips' is the number of chips the opponent have put in the pot.  'rest_chips' is how many chips you have now, 'opponent_rest_chips' is how many chips your opponent have now."
}